Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.SetIntermediateColors(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry})
Set intermediate color entries (other than the minimum and maximum settings).
map:
Array of intermediate color entries.
Throws Autodesk.Revit.Exceptions.ArgumentException:
intermediate color entries with specific values are not ordered by value (min to max) or too many intermediate colors (>100).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.AreIntermediateColorsValid(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry})
Verify intermediate color entries
map:
Array of intermediate color entries.
Returns:
True if intermediate colors are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011